[
  {
    "nome": "Python",
    "descricao": "Linguagem de alto nível, interpretada, focada em legibilidade de código e amplamente utilizada em ciência de dados e desenvolvimento web.",
    "data_criacao": "1991",
    "criador": "Guido van Rossum",
    "link": "https://www.python.org"
  },
  {
    "nome": "Java",
    "descricao": "Linguagem orientada a objetos, compilada em bytecode, projetada para ser multiplataforma ('Write Once, Run Anywhere').",
    "data_criacao": "1995",
    "criador": "James Gosling (Sun Microsystems)",
    "link": "https://www.java.com"
  },
  {
    "nome": "JavaScript",
    "descricao": "Linguagem essencial para o desenvolvimento front-end web, que permite interatividade dinâmica e é executada primariamente em navegadores.",
    "data_criacao": "1995",
    "criador": "Brendan Eich (Netscape)",
    "link": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
  },
  {
    "nome": "C",
    "descricao": "Linguagem de programação de propósito geral que influenciou profundamente a maioria das linguagens modernas. Usada para sistemas operacionais e hardware.",
    "data_criacao": "1972",
    "criador": "Dennis Ritchie",
    "link": "https://en.wikipedia.org/wiki/C_(programming_language)"
  },
  {
    "nome": "C++",
    "descricao": "Extensão do C, adicionando recursos orientados a objetos e manipulação de baixo nível, ideal para jogos, sistemas operacionais e aplicações de alta performance.",
    "data_criacao": "1983",
    "criador": "Bjarne Stroustrup",
    "link": "https://isocpp.org"
  },
  {
    "nome": "C#",
    "descricao": "Linguagem moderna orientada a objetos desenvolvida pela Microsoft, primariamente usada com o framework .NET para Windows, web e desenvolvimento de jogos (Unity).",
    "data_criacao": "2000",
    "criador": "Microsoft",
    "link": "https://docs.microsoft.com/en-us/dotnet/csharp/"
  },
  {
    "nome": "Go",
    "descricao": "Linguagem de código aberto do Google focada em simplicidade, segurança e alta concorrência, popular em microsserviços e infraestrutura de rede.",
    "data_criacao": "2009",
    "criador": "Robert Griesemer, Rob Pike e Ken Thompson (Google)",
    "link": "https://golang.org"
  },
  {
    "nome": "Swift",
    "descricao": "Linguagem robusta e moderna desenvolvida pela Apple para iOS, macOS, watchOS e tvOS, focada em segurança e velocidade.",
    "data_criacao": "2014",
    "criador": "Apple",
    "link": "https://www.swift.org"
  },
  {
    "nome": "Kotlin",
    "descricao": "Linguagem pragmática que roda na JVM (Java Virtual Machine), oficialmente adotada pelo Google para o desenvolvimento Android.",
    "data_criacao": "2011",
    "criador": "JetBrains",
    "link": "https://kotlinlang.org"
  },
  {
    "nome": "Ruby",
    "descricao": "Linguagem dinâmica orientada a objetos focada em produtividade e elegância, popularizada pelo framework Ruby on Rails.",
    "data_criacao": "1995",
    "criador": "Yukihiro Matsumoto (Matz)",
    "link": "https://www.ruby-lang.org"
  },
  {
    "nome": "PHP",
    "descricao": "Linguagem de script do lado do servidor, amplamente utilizada para desenvolvimento web e criação de sistemas de gerenciamento de conteúdo (CMS) como o WordPress.",
    "data_criacao": "1995",
    "criador": "Rasmus Lerdorf",
    "link": "https://www.php.net"
  },
  {
    "nome": "Rust",
    "descricao": "Linguagem focada em segurança, concorrência e performance, projetada para substituir C/C++ em cenários de sistema.",
    "data_criacao": "2010",
    "criador": "Graydon Hoare (Mozilla Research)",
    "link": "https://www.rust-lang.org"
  },
  {
    "nome": "TypeScript",
    "descricao": "Superset tipado estaticamente de JavaScript que compila para JS puro, melhorando a escalabilidade de grandes projetos web.",
    "data_criacao": "2012",
    "criador": "Microsoft",
    "link": "https://www.typescriptlang.org"
  },
  {
    "nome": "Scala",
    "descricao": "Linguagem que combina recursos de linguagens orientadas a objetos e funcionais, rodando na JVM. Usada em big data e sistemas distribuídos.",
    "data_criacao": "2003",
    "criador": "Martin Odersky",
    "link": "https://www.scala-lang.org"
  },
  {
    "nome": "Haskell",
    "descricao": "Linguagem funcional pura, lazy evaluation e tipagem forte, primariamente usada em pesquisa e desenvolvimento de software robusto.",
    "data_criacao": "1990",
    "criador": "Vários Contribuidores (Comitê)",
    "link": "https://www.haskell.org"
  },
  {
    "nome": "Lisp",
    "descricao": "Uma das linguagens de programação mais antigas, conhecida por sua sintaxe baseada em parênteses e uso em inteligência artificial.",
    "data_criacao": "1958",
    "criador": "John McCarthy",
    "link": "https://www.lisp.org"
  },
  {
    "nome": "Erlang",
    "descricao": "Linguagem funcional para construção de sistemas distribuídos, tolerantes a falhas e de alta disponibilidade, desenvolvida pela Ericsson.",
    "data_criacao": "1986",
    "criador": "Ericsson",
    "link": "https://www.erlang.org"
  },
  {
    "nome": "R",
    "descricao": "Linguagem de programação e ambiente de software livre para computação estatística e gráficos, essencial em análise de dados.",
    "data_criacao": "1993",
    "criador": "Ross Ihaka e Robert Gentleman",
    "link": "https://www.r-project.org"
  },
  {
    "nome": "Lua",
    "descricao": "Linguagem de script leve e embutível, projetada no Brasil. Muito usada em desenvolvimento de jogos (como motor de script) e sistemas embarcados.",
    "data_criacao": "1993",
    "criador": "PUC-Rio (Roberto Ierusalimschy, Luiz Henrique de Figueiredo, Waldemar Celes)",
    "link": "https://www.lua.org"
  },
  {
    "nome": "Dart",
    "descricao": "Linguagem otimizada para desenvolvimento de UI, utilizada primariamente com o framework Flutter para criar aplicações nativas multiplataforma.",
    "data_criacao": "2011",
    "criador": "Google",
    "link": "https://dart.dev"
  },
  {
    "nome": "Elixir",
    "descricao": "Linguagem dinâmica e funcional que roda na máquina virtual Erlang (BEAM), excelente para sistemas distribuídos e em tempo real.",
    "data_criacao": "2012",
    "criador": "José Valim",
    "link": "https://elixir-lang.org"
  },
  {
    "nome": "COBOL",
    "descricao": "Linguagem voltada para processamento de dados comerciais e financeiros. Ainda utilizada em sistemas bancários e governamentais legados.",
    "data_criacao": "1959",
    "criador": "CODASYL",
    "link": "https://en.wikipedia.org/wiki/COBOL"
  },
  {
    "nome": "Fortran",
    "descricao": "A primeira linguagem de alto nível comercialmente disponível, focada em computação científica, matemática e engenharia.",
    "data_criacao": "1957",
    "criador": "John Backus (IBM)",
    "link": "https://fortran-lang.org"
  },
  {
    "nome": "Prolog",
    "descricao": "Linguagem de programação lógica, baseada em fatos e regras, usada em inteligência artificial e processamento de linguagem natural.",
    "data_criacao": "1972",
    "criador": "Alain Colmerauer e Phillipe Roussel",
    "link": "https://en.wikipedia.org/wiki/Prolog"
  },
  {
    "nome": "Scheme",
    "descricao": "Dialeto minimalista de Lisp, conhecido por seu foco em clareza, funcionalidade e ser frequentemente usado em ensino acadêmico.",
    "data_criacao": "1975",
    "criador": "Guy L. Steele Jr. e Gerald Jay Sussman",
    "link": "https://scheme.org"
  }
]